function t(t, e) {
    return t >> e & 1;
}

function e() {
    var e, r, a, u, A = !1, i = (c = 3 != arguments.length ? new Date() : new Date(arguments[0], arguments[1], arguments[2])).getYear();
    for (i < 1900 && (i += 1900), e = 365 * (i - 1921) + Math.floor((i - 1921) / 4) + g[c.getMonth()] + c.getDate() - 38, 
    c.getYear() % 4 == 0 && c.getMonth() > 1 && e++, r = 0; ;r++) {
        for (a = u = f[r] < 4095 ? 11 : 12; a >= 0; a--) {
            if (e <= 29 + t(f[r], a)) {
                A = !0;
                break;
            }
            e = e - 29 - t(f[r], a);
        }
        if (A) break;
    }
    n = 1921 + r, o = u - a + 1, h = e, 12 == u && (o == Math.floor(f[r] / 65536) + 1 && (o = 1 - o), 
    o > Math.floor(f[r] / 65536) + 1 && o--);
}

function r() {
    var t = "";
    return t += u.charAt((n - 4) % 10), t += A.charAt((n - 4) % 12), t += "(", t += D.charAt((n - 4) % 12), 
    t += ")年 ", o < 1 ? (t += "(闰)", t += l.charAt(-o - 1)) : t += l.charAt(o - 1), 
    t += "月", t += h < 11 ? "初" : h < 20 ? "十" : h < 30 ? "廿" : "三十", h % 10 == 0 && 10 != h || (t += i.charAt((h - 1) % 10)), 
    t;
}

function a(t, a, n) {
    return t < 1921 || t > 2020 ? "" : (a = parseInt(a) > 0 ? a - 1 : 11, e(t, a, n), 
    r());
}

var n, o, h, c, f = new Array(100), g = new Array(12), u = "甲乙丙丁戊己庚辛壬癸", A = "子丑寅卯辰巳午未申酉戌亥", i = "一二三四五六七八九十", l = "正二三四五六七八九十冬腊", D = "鼠牛虎兔龙蛇马羊猴鸡狗猪";

f = new Array(2635, 333387, 1701, 1748, 267701, 694, 2391, 133423, 1175, 396438, 3402, 3749, 331177, 1453, 694, 201326, 2350, 465197, 3221, 3402, 400202, 2901, 1386, 267611, 605, 2349, 137515, 2709, 464533, 1738, 2901, 330421, 1242, 2651, 199255, 1323, 529706, 3733, 1706, 398762, 2741, 1206, 267438, 2647, 1318, 204070, 3477, 461653, 1386, 2413, 330077, 1197, 2637, 268877, 3365, 531109, 2900, 2922, 398042, 2395, 1179, 267415, 2635, 661067, 1701, 1748, 398772, 2742, 2391, 330031, 1175, 1611, 200010, 3749, 527717, 1452, 2742, 332397, 2350, 3222, 268949, 3402, 3493, 133973, 1386, 464219, 605, 2349, 334123, 2709, 2890, 267946, 2773, 592565, 1210, 2651, 395863, 1323, 2707, 265877), 
g[0] = 0, g[1] = 31, g[2] = 59, g[3] = 90, g[4] = 120, g[5] = 151, g[6] = 181, g[7] = 212, 
g[8] = 243, g[9] = 273, g[10] = 304, g[11] = 334;

var w = new Date(), M = w.getFullYear();

w.getMonth(), w.getDate(), w.getDay(), parseInt(w.getTime() / 1e3);

M < 100 && (M = "19" + M), module.exports = {
    GetLunarDay: a
};