var s = {
    2: "转存失败，请稍后再试",
    111: "转存失败，请稍后再试",
    120: "转存文件数过多，请升级超级会员后再试",
    31034: "操作过于频繁，请稍后再试",
    31175: "文件数过多，暂不支持转存",
    31075: "转存文件数过多，请升级会员后再试",
    "-10": "网盘容量不足，转存失败",
    "-32": "网盘容量不足，转存失败",
    "-33": "文件数过多，暂不支持转存",
    "-8": "文件已存在，点击查看",
    "-30": "文件已存在，点击查看",
    "-95": "转存失败，请关联百度网盘账号后再试"
}, n = {
    120: "转存文件数超限，可长按选择部分文件保存",
    31075: "转存文件数超限，可长按选择部分文件保存",
    31175: "转存文件数超限，可长按选择部分文件保存",
    "-10": "网盘容量不足，可长按选择部分文件保存",
    "-32": "网盘容量不足，可长按选择部分文件保存",
    "-33": "转存文件数超限，可长按选择部分文件保存"
}, r = {
    mis_0: "你来晚了，\n分享文件已经被取消了",
    mis_3: "分享链接中有违规或违法内容，\n无法继续查看",
    mis_110: "访问频率过高，\n请稍后再试",
    "mis_-9": "你来晚了，分享文件已被删除",
    0: "你来晚了，分享文件已被删除",
    1: "你来晚了，分享文件已经被取消了",
    2: "你访问的文件正在审核，\n稍等一会儿再来重试一下吧",
    3: "分享链接中有违规或违法内容，无法继续查看",
    5: "链接错误没找到文件，\n请打开正确的分享链接",
    10: "你来晚了，该分享文件已过期",
    11: "由于访问次数过多，\n该分享链接已失效"
};

module.exports = {
    transferMsg: s,
    shareListMsg: r,
    autoEnterSelectErrnoMap: n
};